export const quranJuzs = [
  {
    id: 1,
    juzName: "الجزء الأول",
    startSurah: "الفاتحة",
    startAyah: 1,
    endSurah: "البقرة",
    endAyah: 141,
  },
  {
    id: 2,
    juzName: "الجزء الثاني",
    startSurah: "البقرة",
    startAyah: 142,
    endSurah: "البقرة",
    endAyah: 252,
  },
  {
    id: 3,
    juzName: "الجزء الثالث",
    startSurah: "البقرة",
    startAyah: 253,
    endSurah: "آل عمران",
    endAyah: 92,
  },
  {
    id: 4,
    juzName: "الجزء الرابع",
    startSurah: "آل عمران",
    startAyah: 93,
    endSurah: "النساء",
    endAyah: 23,
  },
  {
    id: 5,
    juzName: "الجزء الخامس",
    startSurah: "النساء",
    startAyah: 24,
    endSurah: "النساء",
    endAyah: 147,
  },
  {
    id: 6,
    juzName: "الجزء السادس",
    startSurah: "النساء",
    startAyah: 148,
    endSurah: "المائدة",
    endAyah: 81,
  },
  {
    id: 7,
    juzName: "الجزء السابع",
    startSurah: "المائدة",
    startAyah: 82,
    endSurah: "الأنعام",
    endAyah: 110,
  },
  {
    id: 8,
    juzName: "الجزء الثامن",
    startSurah: "الأنعام",
    startAyah: 111,
    endSurah: "الأعراف",
    endAyah: 87,
  },
  {
    id: 9,
    juzName: "الجزء التاسع",
    startSurah: "الأعراف",
    startAyah: 88,
    endSurah: "الأنفال",
    endAyah: 40,
  },
  {
    id: 10,
    juzName: "الجزء العاشر",
    startSurah: "الأنفال",
    startAyah: 41,
    endSurah: "التوبة",
    endAyah: 92,
  },
  {
    id: 11,
    juzName: "الجزء الحادي عشر",
    startSurah: "التوبة",
    startAyah: 93,
    endSurah: "هود",
    endAyah: 5,
  },
  {
    id: 12,
    juzName: "الجزء الثاني عشر",
    startSurah: "هود",
    startAyah: 6,
    endSurah: "يوسف",
    endAyah: 52,
  },
  {
    id: 13,
    juzName: "الجزء الثالث عشر",
    startSurah: "يوسف",
    startAyah: 53,
    endSurah: "إبراهيم",
    endAyah: 52,
  },
  {
    id: 14,
    juzName: "الجزء الرابع عشر",
    startSurah: "الحجر",
    startAyah: 1,
    endSurah: "النحل",
    endAyah: 128,
  },
  {
    id: 15,
    juzName: "الجزء الخامس عشر",
    startSurah: "الإسراء",
    startAyah: 1,
    endSurah: "الكهف",
    endAyah: 74,
  },
  {
    id: 16,
    juzName: "الجزء السادس عشر",
    startSurah: "الكهف",
    startAyah: 75,
    endSurah: "طه",
    endAyah: 135,
  },
  {
    id: 17,
    juzName: "الجزء السابع عشر",
    startSurah: "الأنبياء",
    startAyah: 1,
    endSurah: "الحج",
    endAyah: 78,
  },
  {
    id: 18,
    juzName: "الجزء الثامن عشر",
    startSurah: "المؤمنون",
    startAyah: 1,
    endSurah: "الفرقان",
    endAyah: 20,
  },
  {
    id: 19,
    juzName: "الجزء التاسع عشر",
    startSurah: "الفرقان",
    startAyah: 21,
    endSurah: "النمل",
    endAyah: 55,
  },
  {
    id: 20,
    juzName: "الجزء العشرون",
    startSurah: "النمل",
    startAyah: 56,
    endSurah: "العنكبوت",
    endAyah: 45,
  },
  {
    id: 21,
    juzName: "الجزء الحادي والعشرون",
    startSurah: "العنكبوت",
    startAyah: 46,
    endSurah: "الأحزاب",
    endAyah: 30,
  },
  {
    id: 22,
    juzName: "الجزء الثاني والعشرون",
    startSurah: "الأحزاب",
    startAyah: 31,
    endSurah: "يس",
    endAyah: 27,
  },
  {
    id: 23,
    juzName: "الجزء الثالث والعشرون",
    startSurah: "يس",
    startAyah: 28,
    endSurah: "الزمر",
    endAyah: 31,
  },
  {
    id: 24,
    juzName: "الجزء الرابع والعشرون",
    startSurah: "الزمر",
    startAyah: 32,
    endSurah: "فصلت",
    endAyah: 46,
  },
  {
    id: 25,
    juzName: "الجزء الخامس والعشرون",
    startSurah: "فصلت",
    startAyah: 47,
    endSurah: "الجاثية",
    endAyah: 37,
  },
  {
    id: 26,
    juzName: "الجزء السادس والعشرون",
    startSurah: "الأحقاف",
    startAyah: 1,
    endSurah: "الذاريات",
    endAyah: 30,
  },
  {
    id: 27,
    juzName: "الجزء السابع والعشرون",
    startSurah: "الذاريات",
    startAyah: 31,
    endSurah: "الحديد",
    endAyah: 29,
  },
  {
    id: 28,
    juzName: "الجزء الثامن والعشرون",
    startSurah: "المجادلة",
    startAyah: 1,
    endSurah: "التحريم",
    endAyah: 12,
  },
  {
    id: 29,
    juzName: "الجزء التاسع والعشرون",
    startSurah: "الملك",
    startAyah: 1,
    endSurah: "المرسلات",
    endAyah: 50,
  },
  {
    id: 30,
    juzName: "الجزء الثلاثون",
    startSurah: "النبأ",
    startAyah: 1,
    endSurah: "الناس",
    endAyah: 6,
  },
];

export const quranAhzab = [
  { id: 1, hizbNumber: 1, startSurah: "الفاتحة", startAyah: 1, endSurah: "البقرة", endAyah: 74 },
  { id: 2, hizbNumber: 2, startSurah: "البقرة", startAyah: 75, endSurah: "البقرة", endAyah: 141 },
  { id: 3, hizbNumber: 3, startSurah: "البقرة", startAyah: 142, endSurah: "البقرة", endAyah: 202 },
  { id: 4, hizbNumber: 4, startSurah: "البقرة", startAyah: 203, endSurah: "البقرة", endAyah: 252 },
  { id: 5, hizbNumber: 5, startSurah: "البقرة", startAyah: 253, endSurah: "آل عمران", endAyah: 14 },
  { id: 6, hizbNumber: 6, startSurah: "آل عمران", startAyah: 15, endSurah: "آل عمران", endAyah: 92 },
  { id: 7, hizbNumber: 7, startSurah: "آل عمران", startAyah: 93, endSurah: "النساء", endAyah: 23 },
  { id: 8, hizbNumber: 8, startSurah: "النساء", startAyah: 24, endSurah: "النساء", endAyah: 87 },
  { id: 9, hizbNumber: 9, startSurah: "النساء", startAyah: 88, endSurah: "النساء", endAyah: 147 },
  { id: 10, hizbNumber: 10, startSurah: "النساء", startAyah: 148, endSurah: "المائدة", endAyah: 26 },
  { id: 11, hizbNumber: 11, startSurah: "المائدة", startAyah: 27, endSurah: "الأنعام", endAyah: 35 },
  { id: 12, hizbNumber: 12, startSurah: "الأنعام", startAyah: 36, endSurah: "الأنعام", endAyah: 110 },
  { id: 13, hizbNumber: 13, startSurah: "الأنعام", startAyah: 111, endSurah: "الأعراف", endAyah: 87 },
  { id: 14, hizbNumber: 14, startSurah: "الأعراف", startAyah: 88, endSurah: "الأنفال", endAyah: 40 },
  { id: 15, hizbNumber: 15, startSurah: "الأنفال", startAyah: 41, endSurah: "التوبة", endAyah: 92 },
  { id: 16, hizbNumber: 16, startSurah: "التوبة", startAyah: 93, endSurah: "هود", endAyah: 5 },
  { id: 17, hizbNumber: 17, startSurah: "هود", startAyah: 6, endSurah: "يوسف", endAyah: 52 },
  { id: 18, hizbNumber: 18, startSurah: "يوسف", startAyah: 53, endSurah: "إبراهيم", endAyah: 52 },
  { id: 19, hizbNumber: 19, startSurah: "الحجر", startAyah: 1, endSurah: "النحل", endAyah: 128 },
  { id: 20, hizbNumber: 20, startSurah: "الإسراء", startAyah: 1, endSurah: "الكهف", endAyah: 74 },
  { id: 21, hizbNumber: 21, startSurah: "الكهف", startAyah: 75, endSurah: "طه", endAyah: 135 },
  { id: 22, hizbNumber: 22, startSurah: "الأنبياء", startAyah: 1, endSurah: "الحج", endAyah: 78 },
  { id: 23, hizbNumber: 23, startSurah: "المؤمنون", startAyah: 1, endSurah: "الفرقان", endAyah: 20 },
  { id: 24, hizbNumber: 24, startSurah: "الفرقان", startAyah: 21, endSurah: "النمل", endAyah: 55 },
  { id: 25, hizbNumber: 25, startSurah: "النمل", startAyah: 56, endSurah: "العنكبوت", endAyah: 45 },
  { id: 26, hizbNumber: 26, startSurah: "العنكبوت", startAyah: 46, endSurah: "الأحزاب", endAyah: 30 },
  { id: 27, hizbNumber: 27, startSurah: "الأحزاب", startAyah: 31, endSurah: "يس", endAyah: 27 },
  { id: 28, hizbNumber: 28, startSurah: "يس", startAyah: 28, endSurah: "الزمر", endAyah: 31 },
  { id: 29, hizbNumber: 29, startSurah: "الزمر", startAyah: 32, endSurah: "فصلت", endAyah: 46 },
  { id: 30, hizbNumber: 30, startSurah: "فصلت", startAyah: 47, endSurah: "الجاثية", endAyah: 37 },
  { id: 31, hizbNumber: 31, startSurah: "الأحقاف", startAyah: 1, endSurah: "الذاريات", endAyah: 30 },
  { id: 32, hizbNumber: 32, startSurah: "الذاريات", startAyah: 31, endSurah: "الحديد", endAyah: 29 },
  { id: 33, hizbNumber: 33, startSurah: "المجادلة", startAyah: 1, endSurah: "التحريم", endAyah: 12 },
  { id: 34, hizbNumber: 34, startSurah: "الملك", startAyah: 1, endSurah: "المرسلات", endAyah: 50 },
  { id: 35, hizbNumber: 35, startSurah: "النبأ", startAyah: 1, endSurah: "الناس", endAyah: 6 }
];

export const islamicgoodDeeds = [
  {
    id: 1,
    name: "الصلاة",
    description: "أداء الصلوات الخمس المفروضة يوميًا في أوقاتها.",
    evidence: "قال النبي ﷺ: (أحب الأعمال إلى الله الصلاة على وقتها) متفق عليه."
  },
  {
    id: 2,
    name: "الوالدين",
    description: "الإحسان إلى الوالدين وطاعتهما في غير معصية.",
    evidence: "قال النبي ﷺ: (رضا الله في رضا الوالد، وسخط الله في سخط الوالد) رواه الترمذي."
  },
  {
    id: 3,
    name: "الصيام",
    description: "صيام شهر رمضان، وصيام التطوع مثل الإثنين والخميس.",
    evidence: "قال النبي ﷺ: (من صام رمضان إيمانًا واحتسابًا غُفر له ما تقدم من ذنبه) متفق عليه."
  },
  {
    id: 4,
    name: "الزكاة",
    description: "إخراج نسبة من المال للمحتاجين طاعةً لله.",
    evidence: "قال الله تعالى: (وأقيموا الصلاة وآتوا الزكاة) البقرة: 43."
  },
  {
    id: 5,
    name: "الحج",
    description: "أداء فريضة الحج لمن استطاع.",
    evidence: "قال النبي ﷺ: (الحج المبرور ليس له جزاء إلا الجنة) متفق عليه."
  },
  {
    id: 6,
    name: "الصدقة",
    description: "التبرع بالمال أو الطعام للفقراء والمحتاجين.",
    evidence: "قال النبي ﷺ: (الصدقة تطفئ الخطيئة كما يطفئ الماء النار) رواه الترمذي."
  },
  {
    id: 7,
    name: "ذكر الله",
    description: "التسبيح، التحميد، التهليل، والاستغفار.",
    evidence: "قال النبي ﷺ: (ألا أنبئكم بخير أعمالكم وأزكاها عند مليككم؟ ذكر الله) رواه أحمد."
  },
  {
    id: 8,
    name: "القرآن",
    description: "تلاوة القرآن الكريم وتدبر معانيه.",
    evidence: "قال النبي ﷺ: (اقرؤوا القرآن فإنه يأتي يوم القيامة شفيعًا لأصحابه) رواه مسلم."
  },
  {
    id: 9,
    name: "الإحسان",
    description: "معاملة الناس بالخير، واللطف، والتسامح.",
    evidence: "قال النبي ﷺ: (أحب الناس إلى الله أنفعهم للناس) رواه الطبراني."
  }
];

export const pillarsOfIslam = [
  {
    id: 1,
    name: "الشهادتان",
    description: "الإقرار بأن لا إله إلا الله وأن محمدًا رسول الله.",
    evidence: "قال النبي ﷺ: (بني الإسلام على خمس: شهادة أن لا إله إلا الله، وأن محمدًا رسول الله) متفق عليه.",
  },
  {
    id: 2,
    name: "الصلاة",
    description: "أداء الصلوات الخمس المفروضة يوميًا في أوقاتها.",
    evidence: "قال النبي ﷺ: (أحب الأعمال إلى الله الصلاة على وقتها) متفق عليه.",
  },
  {
    id: 3,
    name: "الزكاة",
    description: "إخراج نسبة من المال لمساعدة الفقراء والمحتاجين.",
    evidence: "قال الله تعالى: ﴿وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ﴾ [البقرة: 110].",
  },
  {
    id: 4,
    name: "الصوم",
    description: "صيام شهر رمضان من الفجر حتى المغرب.",
    evidence: "قال الله تعالى: ﴿يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ﴾ [البقرة: 183].",
  },
  {
    id: 5,
    name: "الحج",
    description: "أداء مناسك الحج لمَن استطاع إليه سبيلًا مرة في العمر.",
    evidence: "قال الله تعالى: ﴿وَلِلَّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلًا﴾ [آل عمران: 97].",
  },
];
export const pillarsOfFaith = [
  {
    id: 1,
    name: "الايمان بالله ",
    description: "الاعتقاد الجازم بوجود الله ووحدانيته في الربوبية والألوهية والأسماء والصفات.",
    evidence: "قال الله تعالى: ﴿آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ﴾ [البقرة: 285].",
  },
  {
    id: 2,
    name: "الايمان بالملائكة",
    description: "الاعتقاد بوجود الملائكة وأنهم مخلوقات نورانية خلقهم الله لعبادته وتنفيذ أوامره.",
    evidence: "قال الله تعالى: ﴿وَالْمَلَائِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيَسْتَغْفِرُونَ لِمَن فِي الْأَرْضِ﴾ [الشورى: 5].",
  },
  {
    id: 3,
    name: " الايمان بالكتب",
    description: "الإيمان بالكتب التي أنزلها الله على أنبيائه، ومنها التوراة، والإنجيل، والزبور، والقرآن الكريم.",
    evidence: "قال الله تعالى: ﴿إِنَّا أَنْزَلْنَا التَّوْرَاةَ فِيهَا هُدًى وَنُورٌ﴾ [المائدة: 44].",
  },
  {
    id: 4,
    name: "الايمان بالرسل ",
    description: "الإيمان بجميع الأنبياء والرسل الذين أرسلهم الله لهداية البشرية، وخاتمهم النبي محمد ﷺ.",
    evidence: "قال الله تعالى: ﴿إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا﴾ [الفتح: 8].",
  },
  {
    id: 5,
    name: "الايمان بالآخرة",
    description: "الإيمان بيوم القيامة، وما فيه من بعث، وحساب، وجنة ونار.",
    evidence: "قال الله تعالى: ﴿وَاتَّقُوا يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ﴾ [البقرة: 281].",
  },
  {
    id: 6,
    name: " الايمان بالقدر",
    description: "الإيمان بأن كل ما يحدث في الكون من خير أو شر هو بتقدير الله وعلمه السابق.",
    evidence: "قال النبي ﷺ: (وأن تؤمن بالقدر خيره وشره) [مسلم].",
  }
];

export const IslamicAzkar =
{
  genaral : [
    {
      id: 1,
      text: "سبحان الله وبحمده، سبحان الله العظيم",
      benefit: "تُغرس لك نخلة في الجنة مع كل تسبيحة.",
      repeat: 100
    },
    {
      id: 2,
      text: "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير",
      benefit: "أفضل الذكر بعد القرآن، وهو حرز من الشيطان.",
      repeat: 100
    },
    {
      id: 3,
      text: "أستغفر الله العظيم وأتوب إليه",
      benefit: "مغفرة الذنوب وزيادة الرزق.",
      repeat: 70
    },
    {
      id: 4,
      text: "اللهم صل وسلم وبارك على نبينا محمد",
      benefit: "شفاعته ﷺ يوم القيامة.",
      repeat: 50
    },
    {
      id: 5,
      text: "حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم",
      benefit: "كفاية الهموم والأحزان.",
      repeat: 7
    },
    {
      id: 6,
      text: "بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم",
      benefit: "حفظ من كل سوء وشر.",
      repeat: 3
    }
  ],
  morningAzkar : [
    {
      id: 1,
      text: "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ 'الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم' -آية الكرسي,البقرة ,255.",
      repeat: 1,
      benefit: "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح."
    },
    {
      id: 2,
      text: "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
      repeat: 1,
      benefit: ""
    },
    {
        id: 3,
        text: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
        repeat: 3,
        benefit: "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)."
    },
    {
        id: 4,
        text: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
        repeat: 3,
        benefit: "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)."
    },
    {
        id: 5,
        text: " بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
        repeat: 3,
        benefit: "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)."
    },
    {
        id: 6,
        text: "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
        repeat: 1,
        benefit: "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح."
    },
    {
        id: 7,
        text: "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
        repeat: 3,
        benefit: "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة."
    },
    {
        id: 8,
        text: "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
        repeat: 4,
        benefit: "من قالها أعتقه الله من النار."
    },
    {
        id: 9,
        text: "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
        repeat: 1,
        benefit: "من قالها حين يصبح أدى شكر يومه."
    },
    {
        id: 10,
        text: "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
        repeat: 7,
        benefit: "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة."
    },
    {
        id: 11,
        text: "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
        repeat: 3,
        benefit: "لم يضره من الله شيء."
    },
    {
        id: 12,
        text: "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
        repeat: 1,
        benefit: ""
    },
    {
        id: 13,
        text: "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
        repeat: 1,
        benefit: ""
    },
    {
        id: 14,
        text: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
        repeat: 3,
        benefit: ""
    },
    {
        id: 15,
        text: "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
        repeat: 3,
        benefit: ""
    },
    {
        id: 16,
        text: "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
        repeat: 3,
        benefit: ""
    },
    {
        id: 17,
        text: "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
        repeat: 1,
        benefit: ""
    },
    {
        id: 18,
        text: "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
        repeat: 3,
        benefit: ""
    },
    {
        id: 19,
        text: "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
        repeat: 1,
        benefit: ""
    },
    {
        id: 20,
        text: "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
        repeat: 1,
        benefit: ""
    },
    {
        id: 21,
        text: "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
        repeat: 3,
        benefit: ""
    },
    {
        id: 22,
        text: "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ،إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ.",
        repeat: 10,
        benefit: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة."
    },
    {
        id: 23,
        text: "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
        repeat: 3,
        benefit: ""
    },
    {
        id: 24,
        text: "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
        repeat: 3,
        benefit: ""
    },
    {
        id: 25,
        text: "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
        repeat: 3,
        benefit: ""
    },
    {
        id: 26,
        text: "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
        repeat: 3,
        benefit: ""
    },
    {
        id: 27,
        text: "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.",
        repeat: 1,
        benefit: ""
    },
    {
        id: 28,
        text: "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
        repeat: 1,
        benefit: ""
    },
    {
        id: 29,
        text: "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
        repeat: 100,
        benefit: "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان."
    },
    {
        id: 30,
        text: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
        repeat: 100,
        benefit: "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ."
    },
    {
        id: 31,
        text: "أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ",
        repeat: 100,
        benefit: "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى."
    }
  ],
  eveningAzkar :[
    { 
        id:1,    
        text: "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ 'الله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم' -آية الكرسي,البقرة ,255.",
        repeat: 1,
        benefit: "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح."
    },
    { 
        id:2,    
        text: "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286]. ",
        repeat: 1,
        benefit: " من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه."
    },
    { 
        id:3,    
        text: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
        repeat: 3,
        benefit: "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)."
    },
    { 
        id:4,    
        text: "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.",
        repeat: 3,
        benefit: "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)."
    },
    { 
        id:4,    
        text: " بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
        repeat: 3,
        benefit: "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)."
    },
    { 
        id:5,    
        text: "أَمْسَيْـنا وَأَمْسـى المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
        repeat: 1,
        benefit: ""
    },
    { 
        id:6,    
        text: "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
        repeat: 1,
        benefit: "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح."
    },
    { 
        id:7,    
        text: "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
        repeat: 3,
        benefit: "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة."
    },
    { 
        id:7,    
        text: "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
        repeat: 4,
        benefit: "من قالها أعتقه الله من النار."
    },
    { 
        id:8,    
        text: "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
        repeat: 1,
        benefit: "من قالها حين يصبح أدى شكر يومه."
    },
    { 
        id:9,    
        text: "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
        repeat: 7,
        benefit: "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة."
    },
    { 
        id:10,    
        text: "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
        repeat: 3,
        benefit: "لم يضره من الله شيء."
    },
    { 
        id:11,    
        text: "اللّهُـمَّ بِكَ أَمْسَيْـنا وَبِكَ أَصْـبَحْنا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
        repeat: 1,
        benefit: ""
    },
    { 
        id:12,    
        text: "أَمْسَيْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
        repeat: 1,
        benefit: ""
    },
    { 
        id:13,    
        text: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
        repeat: 3,
        benefit: ""
    },
    { 
        id:14,    
        text: "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
        repeat: 3,
        benefit: ""
    },
    { 
        id:15,    
        text: "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
        repeat: 3,
        benefit: ""
    },
    { 
        id:16,    
        text: "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
        repeat: 1,
        benefit: ""
    },
    { 
        id:17,    
        text: "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
        repeat: 3,
        benefit: ""
    },
    { 
        id:18,    
        text: "أَمْسَيْنا وَأَمْسَى المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
        repeat: 1,
        benefit: ""
    },
    { 
        id:19,    
        text: "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
        repeat: 1,
        benefit: ""
    },
    { 
        id:20,    
        text: "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
        repeat: 3,
        benefit: ""
    },
    { 
        id:21,    
        text: "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ،إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ.",
        repeat: 10,
        benefit: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة."
    },
    { 
        id:22,    
        text: "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
        repeat: 3,
        benefit: ""
    },
    { 
        id:23,    
        text: "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
        repeat: 3,
        benefit: ""
    },
    { 
        id:24,    
        text: "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
        repeat: 3,
        benefit: ""
    },
    { 
        id:25,    
        text: "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
        repeat: 3,
        benefit: ""
    },
    { 
        id:26,    
        text: "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
        repeat: 1,
        benefit: ""
    },
    { 
        id:27,    
        text: "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
        repeat: 100,
        benefit: "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان."
    },
    { 
        id:28,    
        text: "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
        repeat: 100,
        benefit: "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ."
    }
  ],
  types: [
    {
      id: 1,
      name: "اذكار إسلامية",
    },
    {
      id: 2,
      name: "اذكار الصباح",
    },
    {
      id: 3,
      name: "اذكار المساء",
    }
  ]

};

